read_lef       ./lef/N551P6M_fix_NDR.lef         
read_lef       ./lef/ics55_LLSC_H9CR_ant.lef 
read_verilog   ./prects/prects.v.gz
read_mmmc_file ./mmmc.tcl
read_def       ./prects/prects.def.gz

return
