`timescale 1ns / 1ps
//=============================================================================
// Module Name: compute_engine
// Description: 16×16 MAC计算核心 - 四分块时分复用
// 调用独立 8×8 乘法器：Booth+Wallace+Kogge-Stone 三级流水线
//=============================================================================
module compute_engine (
    input  wire         clk,
    input  wire         rst_n,
    input  wire         mode,
    input  wire         rx_valid,
    input  wire  [15:0] data_A,
    input  wire  [15:0] data_B,
    
    output reg   [23:0] mac_result,
    output reg          mac_carry,
    output reg          calc_done
);

//=============================================================================
// 1. 拆分16bit操作数为高8位/低8位
//=============================================================================
wire [7:0] AH = data_A[15:8];
wire [7:0] AL = data_A[7:0];
wire [7:0] BH = data_B[15:8];
wire [7:0] BL = data_B[7:0];

//=============================================================================
// 2. 7周期时序计数器 (严格对齐你的设计)
//=============================================================================
reg [2:0] cnt;

always @(posedge clk or negedge rst_n) begin
    if(!rst_n)begin
        cnt <= 3'd0;
    end else begin
        if(cnt==3'd6)begin
            cnt <= 3'd0;
        end else begin
            cnt <= (rx_valid) ? 3'd1: cnt + 1'd1;
        end
    end
end

//=============================================================================
// 3. 乘法器输入选择器 (严格按7周期时序)
//=============================================================================
reg [7:0] mul_a;
reg [7:0] mul_b;
always @(*) begin
    case(cnt)
        3'd1: begin mul_a = AH; mul_b = BH; end
        3'd2: begin mul_a = AH; mul_b = BL; end
        3'd3: begin mul_a = AL; mul_b = BH; end
        3'd4: begin mul_a = AL; mul_b = BL; end
        default: begin mul_a = 8'd0; mul_b = 8'd0; end
    endcase
end

//=============================================================================
// 4. 例化独立 8×8 乘法器 (替换完成！)
//=============================================================================
wire [15:0] mul_result;
mul8_pipeline u_mul8_pipeline (
    .clk    (clk),
    .rst_n  (rst_n),
    .a      (mul_a),
    .b      (mul_b),
    .prod   (mul_result)   // 输出8×8乘积
);

//=============================================================================
// 5. 四分块移位累加 (AH*BH<<16 + AH*BL<<8 + AL*BH<<8 + AL*BL)
//=============================================================================


//=============================================================================
// 6. 模式累加 & 溢出判断
//=============================================================================

//=============================================================================
// 7. 输出逻辑
//=============================================================================


endmodule