###################################################################
# Created by write_sdc on Sun Aug 10 15:18:53 2025
###################################################################

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max ETSCA_N55_H9BR_ss_mos_RCworst_1.08_125 -max_library ics55_LLSC_H9CR_ss_rcworst_1p08_125_nldm -min ETSCA_N55_H9BR_ff_mos_RCbest_1.32_-40 -min_library ics55_LLSC_H9CR_ff_rcbest_1p32_m40_nldm

# 设置输出负载 - 32位输出
set_load -pin_load 0.025 [get_ports {result[31]}]
set_load -pin_load 0.025 [get_ports {result[30]}]
set_load -pin_load 0.025 [get_ports {result[29]}]
set_load -pin_load 0.025 [get_ports {result[28]}]
set_load -pin_load 0.025 [get_ports {result[27]}]
set_load -pin_load 0.025 [get_ports {result[26]}]
set_load -pin_load 0.025 [get_ports {result[25]}]
set_load -pin_load 0.025 [get_ports {result[24]}]
set_load -pin_load 0.025 [get_ports {result[23]}]
set_load -pin_load 0.025 [get_ports {result[22]}]
set_load -pin_load 0.025 [get_ports {result[21]}]
set_load -pin_load 0.025 [get_ports {result[20]}]
set_load -pin_load 0.025 [get_ports {result[19]}]
set_load -pin_load 0.025 [get_ports {result[18]}]
set_load -pin_load 0.025 [get_ports {result[17]}]
set_load -pin_load 0.025 [get_ports {result[16]}]
set_load -pin_load 0.025 [get_ports {result[15]}]
set_load -pin_load 0.025 [get_ports {result[14]}]
set_load -pin_load 0.025 [get_ports {result[13]}]
set_load -pin_load 0.025 [get_ports {result[12]}]
set_load -pin_load 0.025 [get_ports {result[11]}]
set_load -pin_load 0.025 [get_ports {result[10]}]
set_load -pin_load 0.025 [get_ports {result[9]}]
set_load -pin_load 0.025 [get_ports {result[8]}]
set_load -pin_load 0.025 [get_ports {result[7]}]
set_load -pin_load 0.025 [get_ports {result[6]}]
set_load -pin_load 0.025 [get_ports {result[5]}]
set_load -pin_load 0.025 [get_ports {result[4]}]
set_load -pin_load 0.025 [get_ports {result[3]}]
set_load -pin_load 0.025 [get_ports {result[2]}]
set_load -pin_load 0.025 [get_ports {result[1]}]
set_load -pin_load 0.025 [get_ports {result[0]}]

# 创建虚拟时钟（用于组合逻辑的输入输出约束）
create_clock -name vclk -period 20

# 设置输入延迟 - 16位输入a
set_input_delay -clock vclk -max 6 [get_ports {a[15]}]
set_input_delay -clock vclk -max 6 [get_ports {a[14]}]
set_input_delay -clock vclk -max 6 [get_ports {a[13]}]
set_input_delay -clock vclk -max 6 [get_ports {a[12]}]
set_input_delay -clock vclk -max 6 [get_ports {a[11]}]
set_input_delay -clock vclk -max 6 [get_ports {a[10]}]
set_input_delay -clock vclk -max 6 [get_ports {a[9]}]
set_input_delay -clock vclk -max 6 [get_ports {a[8]}]
set_input_delay -clock vclk -max 6 [get_ports {a[7]}]
set_input_delay -clock vclk -max 6 [get_ports {a[6]}]
set_input_delay -clock vclk -max 6 [get_ports {a[5]}]
set_input_delay -clock vclk -max 6 [get_ports {a[4]}]
set_input_delay -clock vclk -max 6 [get_ports {a[3]}]
set_input_delay -clock vclk -max 6 [get_ports {a[2]}]
set_input_delay -clock vclk -max 6 [get_ports {a[1]}]
set_input_delay -clock vclk -max 6 [get_ports {a[0]}]

# 设置输入延迟 - 16位输入b
set_input_delay -clock vclk -max 6 [get_ports {b[15]}]
set_input_delay -clock vclk -max 6 [get_ports {b[14]}]
set_input_delay -clock vclk -max 6 [get_ports {b[13]}]
set_input_delay -clock vclk -max 6 [get_ports {b[12]}]
set_input_delay -clock vclk -max 6 [get_ports {b[11]}]
set_input_delay -clock vclk -max 6 [get_ports {b[10]}]
set_input_delay -clock vclk -max 6 [get_ports {b[9]}]
set_input_delay -clock vclk -max 6 [get_ports {b[8]}]
set_input_delay -clock vclk -max 6 [get_ports {b[7]}]
set_input_delay -clock vclk -max 6 [get_ports {b[6]}]
set_input_delay -clock vclk -max 6 [get_ports {b[5]}]
set_input_delay -clock vclk -max 6 [get_ports {b[4]}]
set_input_delay -clock vclk -max 6 [get_ports {b[3]}]
set_input_delay -clock vclk -max 6 [get_ports {b[2]}]
set_input_delay -clock vclk -max 6 [get_ports {b[1]}]
set_input_delay -clock vclk -max 6 [get_ports {b[0]}]

# 设置输出延迟 - 32位输出result
set_output_delay -clock vclk -max 6 [get_ports {result[31]}]
set_output_delay -clock vclk -max 6 [get_ports {result[30]}]
set_output_delay -clock vclk -max 6 [get_ports {result[29]}]
set_output_delay -clock vclk -max 6 [get_ports {result[28]}]
set_output_delay -clock vclk -max 6 [get_ports {result[27]}]
set_output_delay -clock vclk -max 6 [get_ports {result[26]}]
set_output_delay -clock vclk -max 6 [get_ports {result[25]}]
set_output_delay -clock vclk -max 6 [get_ports {result[24]}]
set_output_delay -clock vclk -max 6 [get_ports {result[23]}]
set_output_delay -clock vclk -max 6 [get_ports {result[22]}]
set_output_delay -clock vclk -max 6 [get_ports {result[21]}]
set_output_delay -clock vclk -max 6 [get_ports {result[20]}]
set_output_delay -clock vclk -max 6 [get_ports {result[19]}]
set_output_delay -clock vclk -max 6 [get_ports {result[18]}]
set_output_delay -clock vclk -max 6 [get_ports {result[17]}]
set_output_delay -clock vclk -max 6 [get_ports {result[16]}]
set_output_delay -clock vclk -max 6 [get_ports {result[15]}]
set_output_delay -clock vclk -max 6 [get_ports {result[14]}]
set_output_delay -clock vclk -max 6 [get_ports {result[13]}]
set_output_delay -clock vclk -max 6 [get_ports {result[12]}]
set_output_delay -clock vclk -max 6 [get_ports {result[11]}]
set_output_delay -clock vclk -max 6 [get_ports {result[10]}]
set_output_delay -clock vclk -max 6 [get_ports {result[9]}]
set_output_delay -clock vclk -max 6 [get_ports {result[8]}]
set_output_delay -clock vclk -max 6 [get_ports {result[7]}]
set_output_delay -clock vclk -max 6 [get_ports {result[6]}]
set_output_delay -clock vclk -max 6 [get_ports {result[5]}]
set_output_delay -clock vclk -max 6 [get_ports {result[4]}]
set_output_delay -clock vclk -max 6 [get_ports {result[3]}]
set_output_delay -clock vclk -max 6 [get_ports {result[2]}]
set_output_delay -clock vclk -max 6 [get_ports {result[1]}]
set_output_delay -clock vclk -max 6 [get_ports {result[0]}]